In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [2]:
n_rows = 5 
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size = (n_rows, n_cols)),
                  columns = cols)

df

   omset  operasional
0     12            4
1     11           12
2     12            8
3     14            2
4     13            8

In [3]:
df['omset'] = df['omset'] * 100_00
df['operasional'] = df['operasional'] * 10_000
df

    omset  operasional
0  120000        40000
1  110000       120000
2  120000        80000
3  140000        20000
4  130000        80000

In [4]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq = 'D')
df = df.reset_index()
df = df.rename(columns = {'index':'tanggal'})
df

C:\Users\User\anaconda3\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal   omset  operasional
0 2000-01-01  120000        40000
1 2000-01-02  110000       120000
2 2000-01-03  120000        80000
3 2000-01-04  140000        20000
4 2000-01-05  130000        80000

In [15]:
formatku = {'tanggal' : '{:%d/%m/%y}',
            'operasional' : 'Rp {:.2f}',
            'omset' : 'Rp{:.2f}'}

laporan = df.style.format(formatku)
laporan

In [11]:
type(laporan)

pandas.io.formats.style.Styler

In [16]:
laporan.hide_index()

In [17]:
laporan.set_caption('Data Omset dan Operasional')

In [14]:
laporan.highlight_min('omset', color = 'pink')
laporan.highlight_max('omset', color = 'lightgreen')

laporan.highlight_min('operasional', color = 'lightblue')
laporan.highlight_max('operasional', color = 'grey')

laporan.highlight_min('omset', color = 'pink')
laporan.highlight_max('omset', color = 'lightgreen')